Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Thank you for your feedback!
zh_cn: 感谢您的反馈！

source: That is, it opens the content of the active commander's panel in the non-active panel.
zh_cn: 也就是说，它在非活动面板中打开主动指挥官面板的内容。

source: That's why RubyMine's code completion (&shortcut:CodeCompletion;) allows type character strings located anywhere within a description.
zh_cn: 这就是为什么 RubyMine 的代码补全(&shortcut:CodeCompletion;)允许位于描述中的任何位置的类型字符串。

source: The "To package" field will be automatically filled with the package shown in the opposite commander's panel.
zh_cn: "To package" 字段将在相对的命令面板显示自动用包进行填充。

source: The "{0}" is not an {1} module file (.iml)
zh_cn: "{0}" 不是 {1} 模块文件 (.iml)

source: The &shortcut:CloseActiveTab; key combination closes the currently opened tab in the Message Window, regardless whether the focus is in there or not.
zh_cn: &shortcut:CloseActiveTab; 组合键会关闭消息窗口中当前打开的选项卡，无论焦点是否在该位置。

source: The &shortcut:JumpToLastWindow; key moves focus from the editor to the last focused tool window.
zh_cn: &shortcut:JumpToLastWindow; 快捷键将光标从编辑器移动到上一次激活的工具窗口。

source: The ''provider'' method return type must be a subtype of the service interface type: {0}
zh_cn: ''provider'' 方法返回类型必须是服务接口类型的子类型：{0}

source: The View | Synchronize Views (&shortcut:CommanderSyncViews;) menu item synchronizes content of both commander's panels.
zh_cn: View | Synchronize Views (&shortcut:CommanderSyncViews;) 菜单同步两个命令面板中的内容。

source: The &shortcut:EditorEscape; key in any tool window moves the focus to the editor.
zh_cn: &shortcut:EditorEscape; 将焦点从任何工具窗口移动到编辑器。

source: The &shortcut:EditorJoinLines; shortcut joins two lines into one and removes unnecessary spaces to match your code style.
zh_cn: &shortcut:EditorJoinLines; 将两行合并为一行，并移除不需要的空格以匹配你的代码样式。

source: The &shortcut:JumpToLastWindow; key moves the focus from the editor to the last focused tool window.
zh_cn: &shortcut:JumpToLastWindow; 将焦点从编辑器移到上一个激活的工具窗口。

source: The 'File watcher available' inspection is invoked on every file that is recognized as the target for applying predefined file watchers (SASS, LESS, SCSS, TypeScript, Jade, Dart2JS or CoffeeScript).
zh_cn: 'File watcher available' 检查器应用于每一个被识别为应用预定义的观察器的对象(SASS, LESS, SCSS, TypeScript, Jade, Dart2JS 或 CoffeeScript)。

source: The Branches popup provides branch operations: Create, Merge, Rebase onto, Delete and mark as Favorite.
zh_cn: Branches 弹窗提供分支操作： Create, Merge, Rebase onto, Delete 以及标记为 Favorite 。

source: The Code Completion feature lets you quickly complete different kinds of statements in the code.
zh_cn: 代码补全功能可以让您快速补全代码中不同类型的语句。

source: The Code | Move Statement Up/Down action is useful for reorganizing the code lines in your file, e.g., for bringing a variable declaration closer to the variable usage.
zh_cn: Code | Move Statement Up/Down 操作对在文件中组织代码行很有用，比如移动一个变量声明使其接近变量的使用。

source: The Code | Move Statement Up/Down action is useful for reorganizing the code lines in your file, e.g., for bringing a variable declaration closer to variable usage.
zh_cn: Code | Move Statement Up/Down 操作对在文件中组织代码行很有用，比如移动一个变量声明使其接近变量的使用。

source: The Edit | Copy Reference action can be used to insert a reference to a field/method/class/file into the current position in the editor.
zh_cn: Edit | Copy Reference 操作可以用来在编辑器中的当前位置插入一个字段/方法/类/文件的引用。

source: The Local Changes tab of the Version Control tool window shows all deleted, modified, and unversioned files in a single view.
zh_cn: Version Control 工具窗口的 Local Changes 选项卡在一个视图中显示所有删除、修改和未加入版本控制的文件。

source: The Quick Definition Viewer (&shortcut:QuickImplementations;) can also be used for items in lookup lists that appear on code completion and class/file/symbol navigaton commands.
zh_cn: Quick Definition Viewer(快速定义查看) (&shortcut:QuickImplementations;) 也可以用于代码补全或类/文件/符号导航命令时显示的查询列表。

source: The Quick Definition Viewer (&shortcut:QuickImplementations;) can be also used for items in lookup lists that appear on code completion and class/file/symbol navigaton commands.
zh_cn: Quick Definition Viewer(快速定义查看) (&shortcut:QuickImplementations;) 也可以用于代码补全或类/文件/符号导航命令时显示的查询列表。

source: The Version Control tool window shows all deleted, modified, and unversioned files in a single view.
zh_cn: Version Control 工具窗口在一个视图中显示所有删除、修改和未加入版本控制的文件。

source: The color properties have the icons of the corresponding color in the left gutter area of the editor.
zh_cn: color 属性在编辑器左边的 gutter 中有相应颜色的图标。

source: The CodeCompletion feature can suggest a name for a variable when you declare it.
zh_cn: 当您声明变量时，代码补全功能可以为它提供一个建议名称。

source: The Extract Constant refactoring creates a constant that holds the selected expression as the value and replaces its occurrences as the references to this newly created constant.
zh_cn: 提取常量重构创建一个常量，将所选表达式保存为值，并将其作为对新创建的常量的引用的替换。

source: The Extract Constant refactoring creates a constant which holds the selected expression as the value and replaces its occurrences by reference to this newly created constant.
zh_cn: 提取常量重构创建一个常量，将所选表达式保存为值，并将其作为对新创建的常量的引用的替换。

source: The Extract Field refactoring creates a field which holds the selected expression as the value and replaces its occurrences by reference to this newly created field.
zh_cn: 提取字段重构创建一个字段，将所选表达式保存为值，并将其作为对新创建的字段的引用的替换。

source: The Extract Method refactoring creates method for a fragment of your code.
zh_cn: Extract Method 重构为您的代码片段创建方法。

source: The Extract Parameter refactoring creates a parameter which holds the selected expression as the value and replaces its occurrences by reference to this newly created parameter.
zh_cn: Extract Parameter 重构将创建一个参数，该参数将所选表达式保存为值，并通过引用此新创建的参数来替换其出现次数。

source: The Extract Variable refactoring helps you simplify complicated statements in your code.
zh_cn: 提取变量重构可帮助您简化代码中的复杂语句。

source: The I18nized Expression template is not a valid expression
zh_cn: 国际化表达式模板不是有效的表达式

source: The IDE can complete not only the names of the types, functions, fields, constants, variables, and keywords, but also whole statements.
zh_cn: IDE 不仅可以补全类型，函数，字段，常量，变量以及关键字的名称，还可以补全整个语句。

source: The IDE comes with a predefined list of code constructs that can be inserted into your code.
zh_cn: IDE 附带了可以插入代码的预定义代码结构列表。

source: The IDE constantly analyzes your code, highlights any detected issues, and offers automatic fixes.
zh_cn: IDE 不断分析您的代码，突出显示检测到的问题，并提供自动修复。

source: The IDE ignores SIGINT - "Stop" button in run configurations may not work.
zh_cn: IDE 忽略 SIGINT - 运行配置中的 "停止" 按钮可能无法正常工作。

source: The IDE ignores SIGINT: the "Stop" button in run configurations may not work.
zh_cn: IDE 忽略信号：运行配置中的 "停止" 按钮可能不起作用。

source: The IDE is ready for update.
zh_cn: IDE 已准备好进行更新。

source: The IDE offers code completion for the name of a function or field even if the name of its qualifier is not complete.
zh_cn: 即使其限定符的名称未完成，IDE 也会为函数或字段的名称提供代码完成。

source: The IDE supports multiple carets.
zh_cn: IDE 支持多个插入符号。

source: The IDE will generate interface functions with the correct signatures.
zh_cn: IDE 将使用正确的签名生成接口函数。

source: The IDE will prompt you to confirm the expression to extract and ask if you want to replace the occurrences of that expression in other places within a function, if any.
zh_cn: IDE 会提示您确认表达式以提取并询问您是否要在函数内的其他位置替换该表达式的出现位置（如果有）。

source: The IDE will show a preview of the results as you type the search expression.
zh_cn: 在您键入搜索表达式时，IDE 将显示结果预览。

source: The IDE will update all references of the constant and replace them with the value.
zh_cn: IDE 将更新该常量的所有引用并将其替换为该值。

source: The IDE will update all references of the renamed symbol.
zh_cn: IDE 将更新重命名符号的所有引用。

source: The Inline Method refactoring replaces method caller(s) with a method body.
zh_cn: Inline 方法重构用方法主体替换方法调用者。

source: The Inline Variable refactoring replaces redundant variable usage with its last assigned value
zh_cn: 内联变量重构用其上次分配的值替换冗余变量用法

source: The Inline Variable refactoring replaces redundant variable usage with its last assigned value.
zh_cn: 内联变量重构用其上次分配的值替换冗余变量用法。

source: The JDK is not configured properly for this project.
zh_cn: 此项目未正确配置 JDK。

source: The SmartType code completion greatly helps to find methods and variables that are suitable in the current context, by analyzing the expected type of the whole expression.
zh_cn: 通过分析整个表达式的预期类型，智能类型代码补全大大有助于查找在当前上下文中适用的方法和变量。

source: The SmartType code completion may be used after the new keyword, to instantiate an object of the expected type.
zh_cn: 智能代码补全可以用于 new 关键字后，实例化一个期望类型的对象。

source: The SmartType completion also works after the return keyword, in an assignment, in an argument list of a method call and other places.
zh_cn: 智能类型补全也适用于 return 关键字之后、变量申明处、方法调用的参数列表中以及其他地方。

source: The access code is invalid.
zh_cn: 访问代码无效。

source: The already configured hosts appear in the tool window Browse Remote Hosts:
zh_cn: 已配置的主机出现在工具窗口中Browse Remote Hosts：

source: The application is running
zh_cn: 应用正在运行

source: The braces are created, with the caret placed inside:
zh_cn: 大括号会被创建，并且插入符号放在大括号里面：

source: The call to '#ref' always fails as index is out of bounds
zh_cn: 根据索引越界， '#ref' 调用总是失败

source: The call to '#ref' always fails, according to its method contracts
zh_cn: 根据方法合约， '#ref' 调用总是失败

source: The catch blocks for all the exceptions thrown inside the block will be generated automatically.
zh_cn: 代码块内部抛出的所有异常的 catch 块将自动生成。

source: The class {0}, found in the project classpath, has no associated source files
zh_cn: 在项目类路径中找到的类 {0}，没有相关的源文件

source: The clipboard content
zh_cn: 剪贴板内容

source: The code style settings of your project {0} were migrated to the new format.
zh_cn: 项目 {0} 的代码样式设置已迁移到新格式。

source: The command line launcher is outdated.
zh_cn: 命令行启动器已经过时了。

source: The compilation task will also contain<br/>the fail task.<ul>{0}</ul></html>
zh_cn: 编译任务还将包含<br/>失败任务。<ul>{0}</ul></html>

source: The compiler is running.
zh_cn: 编译器正在运行。

source: The console becomes interactive, and shows a prompt, where you can enter commands, and view output.
zh_cn: 控制台变为交互式，并显示一个提示符，您可以在其中输入命令并查看输出。

source: The corresponding Eclipse project is imported with default settings, without launching the wizard.
zh_cn: 将会使用默认设置导入相应的 Eclipse 项目，而不启动向导。

source: The corresponding Maven project is imported with default settings, without launching the wizard.
zh_cn: 使用默认设置导入相应的 Maven 项目，而不启动向导。

source: The data is invalid.
zh_cn: 数据无效。

source: The debuggee VM version is "1.4.0".
zh_cn: 调试程序的虚拟机版本是 "1.4.0"。

source: The declaration of ''{0}'' does not have a valid java.lang.annotation.Repeatable annotation
zh_cn: ''{0}'' 的声明没有有效的 java.lang.annotation.Repeatable 注解

source: The declared exception {0} is never thrown
zh_cn: 声明的异常 {0} 从未抛出

source: The declared exception {0} is never thrown in method implementations
zh_cn: 声明的异常 {0} 从未在方法实现中抛出

source: The declared exception {0} is never thrown in this method, nor in its derivables
zh_cn: 声明的异常 {0} 不会在此方法中引用，也不会在其派生中抛出

source: The default icon will be added to this action.
zh_cn: 默认图标将添加到此操作。

source: The destination directory does not correspond to any package
zh_cn: 目标目录不对应于任何包

source: The device does not recognize the command.
zh_cn: 设备无法识别该命令。

source: The device is not ready.
zh_cn: 设备尚未准备就绪。

source: The directory ''{0}'' is not empty.
zh_cn: 目录 ''{0}'' 不为空。

source: The directory cannot be removed.
zh_cn: 目录无法被删除。

source: The directory of the module file
zh_cn: 模块文件的目录

source: The directory of the project file
zh_cn: 项目文件的目录

source: The documentation for this element is not found.
zh_cn: 找不到此元素的文档。

source: The drive cannot find the sector requested.
zh_cn: 驱动器无法找到请求的扇区。

source: The drive cannot locate a specific area or track on the disk.
zh_cn: 驱动器无法在磁盘上找到指定区域或磁道。

source: The easiest way to run a Rake task is to choose Run Rake task in the Tools menu, or to press &shortcut:org.jetbrains.plugins.ruby.tasks.rake.actions.RakeTasksPopupAction;.
zh_cn: 运行 Rake 任务的最简单方法是在 Tools 菜单中选择 Run Rake task，或按 &shortcut:org.jetbrains.plugins.ruby.tasks.rake.actions.RakeTasksPopupAction;

source: The easiest way to run a utility of the manage.py task is to choose Run manage.py Task in the Tools menu, or press &shortcut:Django.RunManageTaskAction;.
zh_cn: 运行 manage.py 任务最简单的方法是在 Tools 菜单中选择 Run manage.py Task 或者按 &shortcut:Django.RunManageTaskAction; 。

source: The easiest way to toggle the spelling of a symbol between the CamelCase and the snake_case is to select the symbol and press &shortcut:ToggleCamelSnakeCase;.
zh_cn: 在 CamelCase（驼峰） 和 snake_case（下划线） 之间切换符号拼写的最简单方法是选择符号，然后按 &shortcut:ToggleCamelSnakeCase;。

source: The environment is incorrect.
zh_cn: 环境不正确。

source: The field should be declared in a class
zh_cn: 应在类中声明该字段

source: The file ''{0}'' already exists.
zh_cn: 文件 ''{0}'' 已经存在。

source: The file ''{0}'' is not associated with any file type.
zh_cn: 文件 ''{0}'' 未关联任何文件类型。

source: The file ''{0}'' is not of a known file type.
zh_cn: 文件 ''{0}'' 不是已知的文件类型。

source: The file does not exist.
zh_cn: 该文件不存在。

source: The file doesn''t seem to be a valid Intellij IDEA XML scheme, it should contain ''code_scheme root'' element, found ''{0}'' instead.
zh_cn: 该文件似乎不是一个有效的 IntelliJ IDEA 的 XML 方案文件，它应该包含 ''codescheme root'' 元素，找到的是 ''{0}''。(_S)

source: The file left unchanged.
zh_cn: 文件保持不变。

source: The file was renamed to {1}.
zh_cn: 该文件已重命名为 {1}。

source: The file will be created in this directory
zh_cn: 文件将在此目录中创建

source: The file {0} contains no settings to import.
zh_cn: 文件 {0} 不包含要导入的设置。

source: The files in the selected {1, choice, 1#changelist|2#changelists} are also modified in {0} other {0,choice, 1#changelist|2#changelists}.
zh_cn: 所选更改列表的文件也已经在 {0} 其他更改列表修改。

source: The first 100 search results show in the Preview tab right away.
zh_cn: 前100个搜索结果立即显示在“预览”选项卡中。

source: The following component{0,choice,1# is|2#s are} ready to <a href="update">update</a>: {1}
zh_cn: 下列组件已准备好 <a href="update">更新</a>: {1}

source: The following directory will be marked as a source directory:
zh_cn: 以下目录将被标记为源码目录:

source: The following files are read only: {0}
zh_cn: 以下文件是只读的：{0}

source: The following libraries are missing:
zh_cn: 缺少以下库:

source: The following modules must have the same JDK assigned because of cyclic dependencies between them: {0} Please update modules configuration
zh_cn: 以下模块必须指定相同的 JDK，因为它们之间的循环依赖关系 {0} 请更新模块配置

source: The following modules must have the same language level assigned because of cyclic dependencies between them: {0} Please update modules configuration
zh_cn: 以下模块必须具有相同的语言级别，因为它们之间的循环依赖关系: {0} 请更新模块配置

source: The following pictures show an initial location of a code fragment, and the results of moving the selected fragment up and down.
zh_cn: 以下图片显示了代码片段的初始位置，以及上下移动所选片段的结果。

source: The following plugin{0,choice,1# is|2#s are} ready to <a href="update">update</a>: {1}
zh_cn: 下列插件已准备好 <a href="update">更新</a>: {1}

source: The following plugin{0,choice,1#|2#s} conflict{0,choice,1#s|2#} with IDE:
zh_cn: 以下插件与 IDE 冲突:

source: The following problems have occurred when adding the files:
zh_cn: 添加文件时出现以下问题：

source: The following problems were found:
zh_cn: 发现以下问题:

source: The following resource patterns are malformed: {0}
zh_cn: 以下资源模式格式错误： {0}

source: The following resource patterns are malformed:{0}
zh_cn: 下面的资源模式异常的:{0}

source: The following rule{0, choice, 1# is|2#s are} violated: {1}
zh_cn: 以下规则被违反: {1}

source: The following uses this type
zh_cn: 该类的下列使用

source: The format of a regular expression can be rather complicated.
zh_cn: 正则表达式的格式可能相当复杂。

source: The format of resource patterns has changed.
zh_cn: 资源模板的格式发生了变化。

source: The handle is invalid.
zh_cn: 句柄无效。

source: The info about unloaded modules is not shared through version control, so your teammates' project configurations won't be affected.
zh_cn: 卸载模块的信息不通过版本控制共享，因此您的队友的项目配置不会受到影响。

source: The keyboard shortcut &shortcut:CheckinProject; enables you to quickly invoke the Commit Changes dialog.
zh_cn: 快捷键 &shortcut:CheckinProject; 使你能够快速调用 Commit Changes（提交更改） 对话框。

source: The language for selected elements has no associated file type
zh_cn: 所选元素的语言没有关联的文件类型

source: The license is per-seat and cannot be used by different users concurrently.
zh_cn: 许可证是单个对应的，不能同时被不同用户使用。

source: The license will expire on {0,date,MMMM dd, yyyy}
zh_cn: 许可证将于 {0,date,yyyy-MM-dd} 到期

source: The list of available options ("wrappers") is context-sensitive and depends on the language that you are currently using.
zh_cn: 可用选项的列表 ("wrappers") 是基于上下文的，并取决于你当前使用的语言。

source: The list of available options is context-sensitive and depends on the language that you are currently using.
zh_cn: 可用选项列表是上下文相关的，取决于您当前使用的语言。

source: The list of the suggested names will be reduced accordingly.
zh_cn: 建议名称的列表将相应减少。

source: The list of tool windows shows up, leaving you with the task of selecting the desired one:
zh_cn: 工具窗口列表显示出来，让您选择所需的工具：

source: The loop could be replaced with Collection.removeIf
zh_cn: 循环可以替换为 Collection.removeIf

source: The media is write protected.
zh_cn: 媒体是写保护的。

source: The method and all its derivables are empty
zh_cn: 该方法及其所有派生项为空

source: The method is empty
zh_cn: 该方法为空

source: The module ''{0}'' does not export the package ''{1}'' to the module ''{2}''
zh_cn: 模块 ''{0}'' 没有将包 ''{1}'' 导出到模块 ''{2}''

source: The module ''{0}'' does not have the module ''{1}'' in requirements
zh_cn: 模块 ''{0}'' 在要求中没有模块 ''{1}''

source: The module ''{0}'' does not open the package ''{1}'' to the module ''{2}''
zh_cn: 模块 ''{0}'' 未打开包 ''{1}'' 给模块 ''{2}''

source: The module content root
zh_cn: 模块内容根:

source: The module file ''{0}'' already exist.
zh_cn: 模块文件 ''{0}'' 已经存在。

source: The module file directory
zh_cn: 模块文件目录

source: The module file will be saved in selected directory
zh_cn: 模块文件将被保存到选中的目录

source: The name of the module file without extension
zh_cn: 没有扩展名的模块文件的名称

source: The name of the project file without extension
zh_cn: 没有扩展名的项目文件的名称

source: The names of the modules in the scope, comma separated
zh_cn: 范围中的模块名称，以逗号分隔

source: The new version has an expiration date and does not require a license.
zh_cn: 新版本具有到期日期，不需要许可证。

source: The old project file will be saved to {2}.
zh_cn: 旧的项目文件将保存到 {2}。

source: The operation will not affect them.
zh_cn: 操作不会影响他们。

source: The page has been modified.
zh_cn: 该页面已被修改。

source: The patch contains files in the following non-existing directories:
zh_cn: 补丁包含以下不存在目录中的文件：

source: The path of the module file
zh_cn: 模块文件的路径

source: The path of the project file
zh_cn: 项目文件的路径

source: The period is used by the Javadoc tool to generate the comment for the overview page
zh_cn: 句号由 javadoc 工具用于生成概述页面的注释

source: The plugin requires IntelliJ IDEA Ultimate
zh_cn: 该插件需要 IntelliJ IDEA Ultimate

source: The plugin was not loaded
zh_cn: 该插件未加载

source: The plugin you want to install optionally requires other plugin{0, choice, 1#|2#s} ({1}).
zh_cn: 您要安装的插件可能需要其他插件 ({1})。

source: The plugin you want to install requires other plugin{0, choice, 1#|2#s} ({1}) which have to be installed as well.
zh_cn: 您要安装的插件需要其他必须的插件 ({1}) 安装好。

source: The port to attach to unspecified
zh_cn: 未指定附加端口

source: The port to listen at unspecified
zh_cn: 未指定监听端口

source: The program issued a command but the command length is incorrect.
zh_cn: 程序提供了一个命令, 但命令长度不正确。

source: The project ''{0}'' has an older format and will be converted.
zh_cn: 项目 ''{0}'' 包含较旧的格式并将被转换。

source: The project file is read-only.
zh_cn: 项目文件是只读的。

source: The project needs to be built for better accuracy of dependencies calculation.
zh_cn: 需要构建项目以提高依赖关系计算的准确性。

source: The project seems to be located on a case-{0,choice,0#|1#in}sensitive file system.<br> This does not match the IDE setting (controlled by property "<tt>idea.case.sensitive.fs</tt>")<br> <a href="https://confluence.jetbrains.com/display/IDEADEV/Filesystem+Case-Sensitivity+Mismatch">More details.</a>
zh_cn: 该项目似乎位于一个大小写-{0,choice,0#|1#不}敏感的文件系统。<br> 这不匹配的 IDE 设置(由 "<tt>idea.case.sensitive.fs</tt>" 属性控制)<br> <a href="https://confluence.jetbrains.com/display/IDEADEV/Filesystem+Case-Sensitivity+Mismatch">更多细节</a>

source: The project uses multiple output paths.
zh_cn: 该项目使用多个输出路径。

source: The project will stay compilable if the method is removed from the {0}.
zh_cn: 如果从 {0} 中删除该方法，该项目将保持编译状态。

source: The project {0} you are about to open has an older format.
zh_cn: 您即将打开的项目 {0} 具有较旧的格式。

source: The project {0} you are about to open has been created by a newer version of {1}.
zh_cn: 您即将开放的项目 {0} 由 {1} 的较新版本创建。

source: The project's class files are out of date.
zh_cn: 项目的类文件已过期。

source: The receiver cannot be used in a static context
zh_cn: 接收器不能在静态上下文中使用

source: The receiver name does not match the enclosing class type
zh_cn: 接收者名称与封闭类类型不匹配

source: The receiver should be the first parameter
zh_cn: 接收机应该是第一个参数

source: The receiver type does not match the enclosing class type
zh_cn: 接收器类型与封闭类类型不匹配

source: The regular expression opens in a separate tab in the editor, where you can type backslashes as is.
zh_cn: 在编辑器中的单独选项卡中打开正则表达式，您可以在其中按正常键入反斜杠。

source: The regular expression opens in a separate tab in the editor, where you can type it as is.
zh_cn: 在编辑器中的单独选项卡中打开正则表达式，您可以在其中按正常键入它。

source: The root already belongs to module "{2}"
zh_cn: 根目录已经属于模块 "{2}"

source: The same action can be used to generate new tests for a function, file or package.
zh_cn: 可以使用相同的操作为函数，文件或包生成新的测试。

source: The sample code featuring selected template will be shown here.
zh_cn: 此处将显示具有所选模板的示例代码。

source: The search template is a well formed expression, but the replacement template is not an expression.
zh_cn: 搜索模板是一个格式正确的表达式，但替换模板不是表达式。

source: The search template is not an expression, but the replacement template is a well formed expression.
zh_cn: 搜索模板不是表达式，而替换模板是一个格式正确的表达式。

source: The selected changes affect only directories and no files, so they cannot be shelved
zh_cn: 所选的更改仅影响目录，而不影响文件，因此不能被搁置

source: The selected directory is not a valid home for {0}
zh_cn: 所选目录不是 {0} 的有效主路径

source: The selected file is not a valid home for {0}
zh_cn: 所选文件不是 {0} 的有效主路径

source: The selected file will open with the caret at the specified line.
zh_cn: 所选文件将打开，并将插入符号置于指定行。

source: The selected name is automatically entered in the editor followed by dot.
zh_cn: 所选名称将在编辑器中自动输入并加上点。

source: The selected name is automatically entered in the editor followed by the entered character.
zh_cn: 选择的名称将在编辑器中自动输入，并在后面加上所输入的符号。

source: The selected {0, choice, 1#module depends|2#modules depend} on {1, choice, 1#module ''''{2}'''' which is|2#{1} modules which are} currently unloaded.
zh_cn: 所选模块依赖的{1, choice, 1#模块 ''''{2}'''' |2#{1} 模块} 当前是卸载的。

source: The selection will move to the first matching item, with the matching part of the caption highlighted.
zh_cn: 选择将移至第一个匹配项目，突出显示标题的匹配部分。

source: The service definition is an enum: {0}
zh_cn: 服务定义是枚举：{0}

source: The service implementation does not have a public default constructor: {0}
zh_cn: 服务实现没有公共默认构造函数：{0}

source: The service implementation is an abstract class: {0}
zh_cn: 服务实现是一个抽象类：{0}

source: The service implementation is an inner class: {0}
zh_cn: 服务实现是一个内部类：{0}

source: The service implementation must be defined in the same module as the provides directive
zh_cn: 服务实现必须在与指令相同的模块中定义

source: The service implementation type must be a subtype of the service interface type, or have a public static no-args 'provider' method
zh_cn: 服务实现类型必须是服务接口类型的子类型，或者具有 public static no-args 'provider' 方法

source: The settings will not be saved until you make the file writable.
zh_cn: 在使文件可写之前，设置将不会被保存。

source: The shortcut is already assigned to other actions.
zh_cn: 快捷键已经分配给其他操作。
